# MomentVector1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineLoad..::..MomentVector1 Property
LineLoad Class See Also
---
The moment vector applied to the start point of the line load, oriented according to OrientTo setting.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ MomentVector1 { get; set; }
```

Visual Basic
---
```text
Public Property MomentVector1 As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ MomentVector1 {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
The default force unit is kN-m/m for metric, and kip-ft/ft for imperial. Use UnitUtils class methods to convert value from or to internal units.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace